Поиск_вакансий_Сервер/src/Documents/Вакансии/Вакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Вакансии</name>
  <registerRecords>InformationRegister.ВакансияНомерКомпанияВакансии</registerRecords>
  <attributes>
    <name>ДатаОбновленияВакансии</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВакансии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Работодатель</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗарплатаДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоНДФЛ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URLСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Метро</name>
    <type>
      <types>CatalogRef.СтанцииМетро</types>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>CatalogRef.Города</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Скрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯзыкПрограммирования</name>
    <type>
      <types>CatalogRef.ЯзыкиПрограммирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Специализация</name>
    <type>
      <types>CatalogRef.Специализации</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючевоеСловоВПоиске</name>
    <type>
      <types>CatalogRef.КлючевыеСлова</types>
    </type>
  </attributes>
  <attributes>
    <name>НеПодходит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтереснаяВакансия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>БылОтклик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавилиМетроИзОписания</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленнаяРабота</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдаленнаяРаботаГород</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Document>

Поиск_вакансий_Сервер/src/InformationRegisters/ВакансияНомерКомпанияВакансии/ВакансияНомерКомпанияВакансии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВакансияНомерКомпанияВакансии</name>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Работодатель</name>
    <type>
      <types>CatalogRef.Работодатели</types>
    </type>
  </attributes>
  <dimensions>
    <name>СайтыВладельцы</name>
    <type>
      <types>EnumRef.СайтыВладельцы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерHH</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Поиск_вакансий_Сервер/src/Documents/Вакансии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ВакансияНомерВакансии
	Движения.ВакансияНомерКомпанияВакансии.Записывать = Истина;
	Движение = Движения.ВакансияНомерКомпанияВакансии.Добавить();
	Движение.СайтыВладельцы = СайтВладелец;
	Движение.НомерHH = НомерHH;
	//Движение.НомерHHРаботодателя = Работодатель.НомерHH;
	Движение.Работодатель = Работодатель;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
